brew "anyenv"
brew "git"
brew "asdf"
brew "awscli"
brew "bat"
brew "cmake"
brew "cue"
brew "curl"
brew "diff-so-fancy"
brew "direnv"
brew "fzf"
brew "gh"
brew "ghq"
brew "gibo"
brew "git-lfs"
brew "git-secrets"
brew "gitleaks"
brew "go"
brew "golangci-lint"
brew "grep"
brew "htop"
brew "imagemagick"
brew "infracost"
brew "jq"
brew "libpq"
brew "peco"
brew "redis"
brew "tflint"
brew "tldr"
brew "tree"
brew "yamllint"
cask "1password-cli"
cask "aws-vault-binary"
cask "claude"
cask "claude-code"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "gcloud-cli"
cask "google-drive"
cask "notion"
cask "raycast"
cask "sequel-ace"
cask "session-manager-plugin"
cask "slack"
cask "spotify"
