tap "homebrew/bundle"
tap "homebrew/services"

brew "anyenv"
brew "asdf"
brew "awscli"
brew "bat"
brew "cmake"
brew "cue"
brew "curl"
brew "diff-so-fancy"
brew "direnv"
brew "docker"
brew "fzf"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "git-secrets"
brew "go"
brew "golangci-lint"
brew "grep"
brew "htop"
brew "jq"
brew "libpq"
brew "peco"
brew "redis"
brew "sops"
brew "tldr"
brew "tree"
brew "yamllint"

cask "1password-cli"
cask "aws-vault"
cask "google-cloud-sdk"
cask "sequel-ace"
